Repository: alex-macedonian/mare
Catalog: po/*.po
Languages: ru

source: mare: no internet connection
ru: mare: нет соединения с интернетом

source: Establish an Internet connection and try again.
ru: Установите интернет-соединение и попробуйте снова.

source: elevated user privileges are already configured
ru: повышенные пользовательские привилегии уже настроены

source: configuring elevated user privileges
ru: настройка повышенных привилегий пользователя

source: configuring elevated user privileges is completed
ru: настройка повышенных привилегий пользователя завершена

source: the firmware-atheros package is already installed on your system
ru: пакет firmware-atheros уже установлен в вашей системе

source: installing the firmware-atheros package
ru: установка пакета firmware-atheros

source: firmware-atheros package installed
ru: пакет firmware-atheros установлен

source: the firmware-atheros_20161130-5_all.deb file does not exist
ru: файл firmware-atheros_20161130-5_all.deb не существует

source: you are using a different storage medium information
ru: вы используете другой носитель информации

source: restart the computer to apply the changes
ru: перезагрузите компьютер, чтобы применить изменения

source: random MAC address is already disabled in the NetworkManager
ru: случайный MAC-адрес уже отключен в NetworkManager

source: disabling random mac address in the NetworkManager
ru: отключение случайного MAC-адреса в NetworkManager

source: disabling random mac address in the NetworkManager is completed
ru: отключение случайного MAC-адреса в NetworkManager завершено

source: configuring package sources
ru: настройка источников пакетов

source: configuring package sources is completed
ru: настройка источников пакетов завершена

source: package sources are is already configured
ru: источники пакетов уже настроены

source: Where are you located? Example: United_Kingdom
ru: Где вы находитесь? Пример: United_Kingdom

source: ========== List of available mirrors ==========
ru: ========== Список доступных зеркал ==========

source: Country Mirrors Ping
ru: Страна Зеркала Пинг

source: Enter the mirror:
ru: Введите зеркало:

source: This mirror is not in the list of available mirrors.
ru: Этого зеркала нет в списке доступных зеркал.

source: Sorry, there is no mirror for your country.
ru: Извините, для вашей страны нет зеркала.

source: Please indicate the country closest to you.
ru: Пожалуйста, укажите страну, ближайшую к вам.

source: the operating system bootloader configurating
ru: настройка загрузчика операционной системы

source: the operating system bootloader configurating is completed
ru: настройка загрузчика операционной системы завершена

source: updating the operating system bootloader configuration
ru: обновление конфигурации загрузчика операционной системы

source: updating the operating system bootloader configuration is completed
ru: обновление конфигурации загрузчика операционной системы завершено

source: the operating system bootloader is already configured
ru: загрузчик операционной системы уже настроен

source: the filesystems table configuring
ru: настройка таблицы файловых систем

source: the filesystems table configuring is completed
ru: настройка таблицы файловых систем завершена

source: the filesystems table already configured
ru: таблица файловых систем уже настроена

source: the /etc/sysctl.conf file has already been edited
ru: файл /etc/sysctl.conf уже отредактирован

source: editing the sysctl.conf file that is in the /etc directory
ru: редактирование файла sysctl.conf, который находится в каталоге /etc

source: inserting blank line into the sysctl.conf file
ru: вставка пустой строки в файл sysctl.conf

source: inserting the line vm.swappiness=30 into the sysctl.conf file
ru: вставка строки vm.swappiness = 30 в файл sysctl.conf

source: inserting the line vm.vfs_cache_pressure=500 into the sysctl.conf file
ru: вставка строки vm.vfs_cache_pressure = 500 в файл sysctl.conf

source: the sysctl.conf file editing is completed
ru: редактирование файла sysctl.conf завершено

source: apply the following changes:
ru: применить следующие изменения:

source: completed
ru: завершено

source: inserting the line vm.swappiness=10 into the sysctl.conf file
ru: вставка строки vm.swappiness = 10 в файл sysctl.conf

source: inserting the line vm.vfs_cache_pressure=1000 into the sysctl.conf file
ru: вставка строки vm.vfs_cache_pressure = 1000 в файл sysctl.conf

source: Select a package number and click «ENTER». To exit, click «Q»
ru: Выберите номер пакета и нажмите «ВВОД». Для выхода нажмите «Q»

source: this package is already installed on your system
ru: этот пакет уже установлен в вашей системе

source: system cleaning
ru: очистка системы

source: system cleaning is completed
ru: очистка системы завершена

source: Number 0. Package: kicad
ru: Номер 0. Пакет: kicad

source: Short description: design of electronic circuits and printed circuit
ru: Краткое описание: проектирование электронных схем и печатных

source: boards. You can get a detailed description of the package by entering
ru: плат. Вы можете получить подробное описание пакета, введя

source: the following at the command line: apt-cache show kicad.
ru: в командной строке следующее: apt-cache show kicad.

source: Number 1. Package: links
ru: Номер 1. Пакет: links

source: Short description: web browser running in text mode.
ru: Краткое описание: веб-браузер работающий в текстовом режиме.

source: You can get a detailed description of the package by entering
ru: Вы можете получить подробное описание пакета, введя

source: the following at the command line: apt-cache show links.
ru: в командной строке следующее: apt-cache show links.

source: Number 2. Package: bleachbit
ru: Номер 2. Пакет: bleachbit

source: Short description: delete unnecessary files from the system.
ru: Краткое описание: удаление ненужных файлов из системы.

source: the following at the command line: apt-cache show bleachbit
ru: в командной строке следующее: apt-cache show bleachbit

source: Number 3. Package: numlockx
ru: Номер 3. Пакет: numlockx

source: Short description: enable NumLock in X11 sessions.
ru: Краткое описание: включает NumLock в сессиях X11.

source: the following at the command line: apt-cache show numlockx.
ru: в командной строке следующее: apt-cache show numlockx.

source: Number 4. Package: testdisk
ru: Номер 4. Пакет: testdisk

source: Short description: partition scan, disk and file recovery.
ru: Краткое описание: сканирование разделов, восстановление дисков и файлов.

source: the following at the command line: apt-cache show testdisk.
ru: в командной строке следующее: apt-cache show testdisk.

source: Number 5.Package: chromium
ru: Номер 5. Пакет: chromium

source: Short description: web browser.
ru: Краткое описание: веб-браузер.

source: the following at the command line: apt-cache show chromium.
ru: в командной строке следующее: apt-cache show chromium.

source: Number 6. Package: chromium-l10n
ru: Номер 6. Пакет: chromium-l10n

source: Short description: web browser localization.
ru: Краткое описание: локализация веб-браузера.

source: the following at the command line: apt-cache show chromium-l10n.
ru: в командной строке следующее: apt-cache show chromium-l10n.

source: Number 7. Package: unrar
ru: Номер 7. Пакет: unrar

source: Short description: unarchiver for .rar files (non-free version).
ru: Краткое описание: распоковщик для файлов .rar (несвободная версия).

source: the following at the command line: apt-cache show unrar.
ru: в командной строке следующее: apt-cache show unrar.

source: Number 8. Package: inxi
ru: Номер 8. Пакет: inxi

source: Short description: full featured system information script.
ru: Краткое описание: полнофункциональный сценарий дающий информацию о системе.

source: the following at the command line: apt-cache show inxi.
ru: в командной строке следующее: apt-cache show inxi.

source: Number 9. Package: lshw
ru: Номер 9. Пакет: lshw

source: Short description: hardware configuration information.
ru: Краткое описание: информация о конфигурации оборудования.

source: the following at the command line: apt-cache show lshw.
ru: в командной строке следующее: apt-cache show lshw.

source: Number 10. Package: net-tools
ru: Номер 10. Пакет: net-tools

source: Short description: toolkit for NET-3.
ru: Краткое описание: инструментарий для NET-3.

source: the following at the command line: apt-cache show net-tools.
ru: в командной строке следующее: apt-cache show net-tools.

source: Number 11. Package: reaver
ru: Номер 11. Пакет: reaver

source: Short description: brute force attack tool against Wifi Protected Setup
ru: Краткое описание: инструмент атаки методом перебора PIN-кода точки доступа

source: PIN number. You can get a detailed description of the package by
ru: Wifi. Вы можете получить подробное описание пакета, введя

source: entering the following at the command line: apt-cache show reaver.
ru: в командной строке следующее: apt-cache show reaver.

source: Number 12. Package: brasero
ru: Номер 12. Пакет: brasero

source: Short description: CD/DVD burning for GNOME.
ru: Краткое описание: запись CD/DVD дисков для окружения рабочего стола GNOME.

source: the following at the command line: apt-cache show brasero.
ru: в командной строке следующее: apt-cache show brasero.

source: Number 13. Package: ttf-mscorefonts-installer
ru: Номер 13. Пакет: ttf-mscorefonts-installer

source: Short description: installer for Microsoft TrueType core fonts.
ru: Краткое описание: установщик основных шрифтов для Microsoft TrueType.

source: the following at the command line: apt-cache show ttf-mscorefonts-installer.
ru: в командной строке следующее: apt-cache show ttf-mscorefonts-installer.

source: Number 14. Package: font-freefont-ttf
ru: Номер 14. Пакет: font-freefont-ttf

source: Short description: free Serif, Sans, and Mono fonts in TrueType format.
ru: Краткое описание: бесплатные шрифты Serif, Sans и Mono в формате TrueType.

source: the following at the command line: apt-cache show font-freefont-ttf.
ru: в командной строке следующее: apt-cache show font-freefont-ttf.

source: Number 15. Package: fonts-noto
ru: Номер 15. Пакет: fonts-noto

source: Short description: metapackage to pull in all Noto fonts.
ru: Краткое описание: метапакет, чтобы получить все шрифты из набора Noto.

source: the following at the command line: apt-cache show fonts-noto.
ru: в командной строке следующее: apt-cache show fonts-noto.

source: Number 16. Package: fonts-noto-core
ru: Номер 16. Пакет: fonts-noto-core

source: Short description: 'No Tofu' font families with large Unicode coverage
ru: Краткое описание: семейства шрифтов No Tofu с большим охватом Unicode

source: (core). You can get a detailed description of the package by entering
ru: (ядро). Вы можете получить подробное описание пакета, введя

source: the following at the command line: apt-cache show fonts-noto-core.
ru: в командной строке следующее: apt-cache show fonts-noto-core.

source: Number 17. Package: fonts-noto-extra
ru: Номер 17. Пакет: fonts-noto-extra

source: (extra). You can get a detailed description of the package by entering
ru: (дополнительный). Вы можете получить подробное описание пакета, введя

source: the following at the command line: apt-cache show fonts-noto-extra.
ru: в командной строке следующее: apt-cache show fonts-noto-extra.

source: the www.deb-multimedia.org website has already
ru: веб-сайт www.deb-multimedia.org уже

source: been added to the /etc/apt/sources.list file
ru: добавлен в файл /etc/apt/sources.list

source: adding the www.deb-multimedia.org website
ru: добавление веб-сайта www.deb-multimedia.org

source: to the /etc/apt/sources.list file
ru: в файл /etc/apt/sources.list

source: the deb-multimedia-keyring package is already installed on your system
ru: пакет deb-multimedia-keyring уже установлен в вашей системе

source: updating the list of available packages
ru: обновление списка доступных пакетов

source: updating the list of available packages is completed
ru: обновление списка доступных пакетов завершено

source: setting the right to run the 00-welcome-header file
ru: установка права на запуск файла 00-welcome-header, который

source: located in the following path: /etc/update-motd.d/
ru: находится по следующему пути: /etc/update-motd.d/

source: setting the right to run the 10-system-info file
ru: установка права на запуск файла 10-system-info

source: setting the right to run the 20-connect-info file
ru: установка права на запуск файла 20-connect-info

source: cleaning the motd file that is in the /etc directory
ru: очистка файла motd, который находится в каталоге /etc

source: the motd file cleanup is completed
ru: очистка файла motd завершена

source: the /etc/motd file is empty
ru: файл /etc /motd уже пустой

source: removal of the right to run in the 10-uname file,
ru: снятие права на запуск в 10-uname файле,

source: which is located on the path: /etc/update-motd.d
ru: который находится по пути: /etc/update-motd.d

source: the /etc/update-motd.d/10-uname file
ru: файл /etc/update-motd.d/10-uname

source: does not have the right for execution
ru: не имеет права на исполнение

source: Now in the console, the message about the last user
ru: Теперь в консоли сообщение о последней аутентификации

source: authentication is displayed before the message of the day.
ru: пользователя отображается перед сообщением дня.

source: Now in the console, the message of the day is displayed
ru: Теперь в консоли сообщение дня отображается перед

source: before the message about the last user authentication.
ru: сообщением о последней аутентификации пользователя.

source: Display message of the day first? (y or n):
ru: Показать сообщение дня первым? (y or n):

source: editing the login file, which is located along the path: /etc/pam.d
ru: редактирование файла login, который расположен по пути: /etc/pam.d

source: the login file editing is completed
ru: редактирование файла login завершено

source: You have entered an invalid character. Try again.
ru: Вы ввели недопустимый символ. Попробуйте еще раз.

source: the numlockx package is already installed on your system
ru: пакет numlockx уже установлен в вашей системе

source: the configuration file for LightDM already exists
ru: конфигурационный файл для LightDM уже существует

source: creating a configuration file for LightDM
ru: создание конфигурационного файла для LightDM

source: creating a configuration file for LightDM is completed
ru: создание конфигурационного файла для LightDM завершено

source: Usage: mare [OPTION]
ru: Использование: mare [OPTION]

source: Performs various settings in Debian GNU/Linux 10 after installation.
ru: Выполняет разные настройки в Debian GNU/Linux 10 после установки.

source: Namely:
ru: А именно:

source: configures elevated privileges for the user;
ru: настраивает повышенные привилегии для пользователя;

source: configures USB WIFI adapter TP-LINK TL-WN722N;
ru: настраивает USB-адаптер WIFI TP-LINK TL-WN722N;

source: configures packages sources and update
ru: настраивает источники пакетов и обновляет

source: the system by updating packages;
ru: систему путем обновления пакетов;

source: configures the bootloader of the operating system;
ru: настраивает загрузчик операционной системы;

source: configures filesystems table;
ru: настраивает таблицу файловых систем;

source: improves system performance;
ru: улучшает производительность системы;

source: sets up additional packages;
ru: устанавливает дополнительные пакеты;

source: sets up additional codecs;
ru: устанавливает дополнительные кодеки;

source: configures the message of the day;
ru: настраивает сообщение дня;

source: configures the LightDM display manager.
ru: настраивает диспетчер дисплея LightDM.

source: -c --conf configure the operating system
ru: -c --conf настроить операционную систему

source: -h --help show this help and exit
ru: -h --help показать эту страницу справки и выйти

source: -v --version show version information and exit
ru: -v --version показать информацию о версии и выйти

source: Example:
ru: Пример:

source: mare -c configure the operating system.
ru: mare -c настроить операционную систему.

source: Mare version 2.0
ru: Mare версия 2.0

source: Copyright (C) 2019 Alexandre Popov. All rights reserved.
ru: Авторское право (C) Попов Александр. Все права защищены.

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.
ru: Лицензия GPLv3+: GNU GPL версии 3 или новее <http://gnu.org/licenses/gpl.html>.

source: This is free software: you are free to change and redistribute it.
ru: Это свободное ПО: вы можете изменять и распространять его.

source: There is NO WARRANTY, to the extent permitted by law.
ru: Нет НИКАКИХ ГАРАНТИЙ до степени, разрешённой законом.

source: mare: you are using a different distribution GNU/Linux
ru: mare: вы используете другой дистрибутив GNU/Linux

source: Welcome to the setup wizard for your system.
ru: Добро пожаловать в мастер настройки вашей системы.

source: For help using the wizard, enter the command:
ru: Чтобы получить справку по использованию мастера, введите команду:

source: mare: wrong key —
ru: mare: неправильный ключ —

source: On command «mare --help» one can get additional information.
ru: По команде «mare --help» можно получить дополнительную информацию.
